Revit 2020 API
PageOrientationType Enumeration
An enumerated type listing all Page Orientation types of Print Setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public enum PageOrientationType
Visual Basic
Public Enumeration PageOrientationType
Visual C++
public enum class PageOrientationType
Members
Member name | Description
Portrait | The type of Page Orientation is Portrait.
Landscape | The type of Page Orientation is Landscape.
See Also
Autodesk.Revit.DB Namespace